# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
# brew 'imagemagick'
brew 'meilisearch'
brew 'mysql-client'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'openjdk'
brew 'yarn'

# Apps
cask '1password-cli'
cask '1password'
cask 'brave-browser'
cask 'dbeaver-community'
cask 'discord'
cask 'disk-inventory-x'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'handbrake'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'macfuse'
cask 'microsoft-teams'
cask 'nordvpn'
cask 'obsidian'
cask 'slack'
cask 'Spotify'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'


# Fonts
cask 'font-lato'
cask 'font-fira-code'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'iA Writer', id: 775737590
mas 'Lightweight PDF', id: 1450640351
mas 'Jolt of caffeine', id: 1437130425
mas 'BetterSnapTool', id: 417375580
mas 'Unsplash Wallpapers', id: 1284863847

